Revit 2027 API
StructuralSectionLAngle.BoltDiameterShorterFlange Property
 Maximum bolt hole diameter in the shorter flange, in. (mm)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BoltDiameterShorterFlange { get; set; }
Public Property BoltDiameterShorterFlange As Double
	Get
	Set
public:
property double BoltDiameterShorterFlange {
	double get ();
	void set (double value);
}
member BoltDiameterShorterFlange : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionLAngle Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace